{
    "architectures": [
      "T5ForConditionalGeneration"
    ],
    "d_model": 512,
    "d_kv": 64,
    "d_ff": 2048,
    "dropout_rate": 0.1,
    "encoder_attention_heads": 6,
    "decoder_attention_heads": 6,
    "encoder_layers": 6,
    "decoder_layers": 6,
    "eos_token_id": 1,
    "feed_forward_proj": "relu",
    "initializer_factor": 1.0,
    "is_encoder_decoder": true,
    "model_type": "t5",
    "num_beams": 4,
    "pad_token_id": 0,
    "relative_attention_num_buckets": 32,
    "task_specific_params": {
      "translation_en_to_fr": {
        "early_stopping": true,
        "length_penalty": 2.0,
        "max_length": 128,
        "num_beams": 4
      }
    },
    "use_cache": true,
    "vocab_size": 32128
  }
